$(function()
{
//Вибір об'єктів на веб-сторінці та методи text(), hide(), show()

//1.Вибір по назві тегу
alert($('h1').text()); //метод text()повертає текстовий вміст обраного елементу.
$('h1').hide(1000);//метод hide() ховає елемент
$('h1').show(1000);//метод show() відображає елемент
//ці два методи hide(),show() можуть приймати необов'язковий параметр - швидкість виконання у мілісекундах(1с=1000мс). 
//2.Вибір елементу по id, по класу
//$('#about-moto').hide();
$('.slide-btn').hide();   //вибір по class
//3.Вибір вкладеного елементу
$('#head text-centerp p').hide();//вибрати всі вкладені теги р у об'єкт з id='head text-center'

//4.
$('#mydiv>img').hide(); //вибрати всі дочірні теги img у об'єкта #mydiv

//5. Вибрати малюнок, який знаходиться після об'єкту #mydiv
$('#mydiv+img').hide();
//6.Вибір по значенню атрибуту об'єкта
$('img[width=200]') //вибрати малюнок шириною 200px;

//7.Вибір тегів, атрибути яких починаються з послідовності символів
$('a[href^=https://google]')
//8.Вибір тегів, атрибути яких містять задану послідовність символів
$('img[src*=moto]')//вибрати всі теги img у яких значення атрибуту src містить слово moto
//9. значення атрибуту закінчується на jpg
$('img[src$=jpg]')  
});

