$(function()
{
//Вибір об'єктів на веб-сторінці та методи text(),hide(),show()

//Вибір по назві тегу
alert($('h1').text()); //метод text()Повертає текстовий вміст обраного елементу
//$('h1').hide(1000);//метод hide() ховає елемент
//$('h1').show(1000);//show() відображає елемент
//Ці два методи можуть приймати необов'язковий параметр - швидкість виконання у мілісекундах(1с=1000мс), або викорстовується slow(), fast()
});
//2.виберіть елемент по ID по класу
//$('#about-moto').hide();
$('.slide-btn').hide();
//3.Вибір вкладеного елементу
$('#head text-centerp p').hide;
//4.
$('#mydiv>img').hide();
//5.Вибрати мальнок, який знаходиться після об'єкту #mydiv
$('#mydiv+img').hide();
//6.Вибір по значенню атребуту
$('img[width=200]')
//7.teg select
$('a[href^=https]')